//문은 프로그램을 수성하는 기본 단위이자 최소 실행단위다. 문의 집합으로 이뤄진 것이 바로
//프로그램이며, 문을 작성하고 순서에 맞게 나열하는 것이 프로그램밍이다.
//문은 여러 토큰으로 구성된다. 토큰이란 문법적인 의미를 가지며, 문법적으로 더 이상 나눌 수 없는 코드의 기본요소를 의미란한다.
//예를 들어, 키워드, 식별자, 연산자, 이터럴, 세미콜론(;)이나 마침표등의 특수 기호는 문법적인 의미를 자지며, 문법적으로 
//더 이상 나눌 수 없는 코드의 기본 요소이므로 모두 토큰이다.
//문을 명령문이라고도 부른다. 즉, 문의 컴퓨터에 내리는 명령이다. 문이 실행되면 명형이 실행되고 무슨 일인가 일어나게 된다.

//문은 선언문, 할당문, 조건문 , 반복문 등으로 구분 할 수 있이다. 0변수 선언문을 실행하면 변수가 선언되도, 할당 문을 
// 실행하면 값이 할당 된다. 조건문을 실행하면 지정한 조건에 따라 실행할 코드 블록이 결정되어 실행되고, 반복문을
//실행하면 코드 블록이 반복 실행된다.
//